dturcu/illd_release_tc3x/src/BaseSw/iLLD/TC3xx/Tricore/_PinMap/TC37xED/IfxGtm_PinMap_TC37xED_516.h
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT148_P34_3_OUT;  /**< \brief IfxGtm_ATOM5_2_TOUT148_P34_3_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT122_P11_5_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT122_P11_5_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT123_P11_7_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT123_P11_7_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT125_P11_13_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT125_P11_13_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT133_P22_7_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT133_P22_7_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT137_P22_11_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT137_P22_11_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT142_P32_7_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT142_P32_7_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT149_P34_4_OUT;  /**< \brief IfxGtm_ATOM5_3_TOUT149_P34_4_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT122_P11_5_OUT;  /**< \brief IfxGtm_ATOM5_4_TOUT122_P11_5_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT123_P11_7_OUT;  /**< \brief IfxGtm_ATOM5_4_TOUT123_P11_7_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT129_P12_1_OUT;  /**< \brief IfxGtm_ATOM5_4_TOUT129_P12_1_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT134_P22_8_OUT;  /**< \brief IfxGtm_ATOM5_4_TOUT134_P22_8_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT150_P34_5_OUT;  /**< \brief IfxGtm_ATOM5_4_TOUT150_P34_5_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT119_P11_0_OUT;  /**< \brief IfxGtm_ATOM5_5_TOUT119_P11_0_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT124_P11_8_OUT;  /**< \brief IfxGtm_ATOM5_5_TOUT124_P11_8_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT135_P22_9_OUT;  /**< \brief IfxGtm_ATOM5_5_TOUT135_P22_9_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT140_P32_5_OUT;  /**< \brief IfxGtm_ATOM5_5_TOUT140_P32_5_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT120_P11_1_OUT;  /**< \brief IfxGtm_ATOM5_6_TOUT120_P11_1_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT125_P11_13_OUT;  /**< \brief IfxGtm_ATOM5_6_TOUT125_P11_13_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT136_P22_10_OUT;  /**< \brief IfxGtm_ATOM5_6_TOUT136_P22_10_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT141_P32_6_OUT;  /**< \brief IfxGtm_ATOM5_6_TOUT141_P32_6_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT96_P11_3_OUT;  /**< \brief IfxGtm_ATOM5_6_TOUT96_P11_3_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT121_P11_4_OUT;  /**< \brief IfxGtm_ATOM5_7_TOUT121_P11_4_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT126_P11_14_OUT;  /**< \brief IfxGtm_ATOM5_7_TOUT126_P11_14_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT137_P22_11_OUT;  /**< \brief IfxGtm_ATOM5_7_TOUT137_P22_11_OUT */
IFX_EXTERN IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT142_P32_7_OUT;  /**< \brief IfxGtm_ATOM5_7_TOUT142_P32_7_OUT */
IFX_EXTERN IfxGtm_Clk_Out IfxGtm_CLK0_P23_1_OUT;  /**< \brief CGM generated clock */
IFX_EXTERN IfxGtm_Clk_Out IfxGtm_CLK1_P32_4_OUT;  /**< \brief CGM generated clock */
IFX_EXTERN IfxGtm_Clk_Out IfxGtm_CLK2_P11_12_OUT;  /**< \brief CGM generated clock */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P00_9_IN;  /**< \brief IfxGtm_TIM0_0_P00_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P02_0_IN;  /**< \brief IfxGtm_TIM0_0_P02_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P10_7_IN;  /**< \brief IfxGtm_TIM0_0_P10_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P14_5_IN;  /**< \brief IfxGtm_TIM0_0_P14_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P14_7_IN;  /**< \brief IfxGtm_TIM0_0_P14_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P15_6_IN;  /**< \brief IfxGtm_TIM0_0_P15_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P21_2_IN;  /**< \brief IfxGtm_TIM0_0_P21_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P22_1_IN;  /**< \brief IfxGtm_TIM0_0_P22_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P33_10_IN;  /**< \brief IfxGtm_TIM0_0_P33_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P33_4_IN;  /**< \brief IfxGtm_TIM0_0_P33_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P00_10_IN;  /**< \brief IfxGtm_TIM0_1_P00_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P02_1_IN;  /**< \brief IfxGtm_TIM0_1_P02_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P10_1_IN;  /**< \brief IfxGtm_TIM0_1_P10_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P14_6_IN;  /**< \brief IfxGtm_TIM0_1_P14_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P15_7_IN;  /**< \brief IfxGtm_TIM0_1_P15_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P21_3_IN;  /**< \brief IfxGtm_TIM0_1_P21_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P22_0_IN;  /**< \brief IfxGtm_TIM0_1_P22_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P33_5_IN;  /**< \brief IfxGtm_TIM0_1_P33_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P33_9_IN;  /**< \brief IfxGtm_TIM0_1_P33_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P00_11_IN;  /**< \brief IfxGtm_TIM0_2_P00_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P02_2_IN;  /**< \brief IfxGtm_TIM0_2_P02_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P02_9_IN;  /**< \brief IfxGtm_TIM0_2_P02_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P10_2_IN;  /**< \brief IfxGtm_TIM0_2_P10_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P10_5_IN;  /**< \brief IfxGtm_TIM0_2_P10_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P15_8_IN;  /**< \brief IfxGtm_TIM0_2_P15_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P21_4_IN;  /**< \brief IfxGtm_TIM0_2_P21_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P23_5_IN;  /**< \brief IfxGtm_TIM0_2_P23_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P33_11_IN;  /**< \brief IfxGtm_TIM0_2_P33_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P33_6_IN;  /**< \brief IfxGtm_TIM0_2_P33_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P00_12_IN;  /**< \brief IfxGtm_TIM0_3_P00_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P02_10_IN;  /**< \brief IfxGtm_TIM0_3_P02_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P02_3_IN;  /**< \brief IfxGtm_TIM0_3_P02_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P10_3_IN;  /**< \brief IfxGtm_TIM0_3_P10_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P10_6_IN;  /**< \brief IfxGtm_TIM0_3_P10_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P14_0_IN;  /**< \brief IfxGtm_TIM0_3_P14_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P21_5_IN;  /**< \brief IfxGtm_TIM0_3_P21_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P22_2_IN;  /**< \brief IfxGtm_TIM0_3_P22_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P32_2_IN;  /**< \brief IfxGtm_TIM0_3_P32_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P33_7_IN;  /**< \brief IfxGtm_TIM0_3_P33_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P02_4_IN;  /**< \brief IfxGtm_TIM0_4_P02_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P10_0_IN;  /**< \brief IfxGtm_TIM0_4_P10_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P14_1_IN;  /**< \brief IfxGtm_TIM0_4_P14_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P21_6_IN;  /**< \brief IfxGtm_TIM0_4_P21_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P22_3_IN;  /**< \brief IfxGtm_TIM0_4_P22_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P32_3_IN;  /**< \brief IfxGtm_TIM0_4_P32_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P33_0_IN;  /**< \brief IfxGtm_TIM0_4_P33_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P33_8_IN;  /**< \brief IfxGtm_TIM0_4_P33_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P01_3_IN;  /**< \brief IfxGtm_TIM0_5_P01_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P02_5_IN;  /**< \brief IfxGtm_TIM0_5_P02_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P10_8_IN;  /**< \brief IfxGtm_TIM0_5_P10_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P14_2_IN;  /**< \brief IfxGtm_TIM0_5_P14_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P21_7_IN;  /**< \brief IfxGtm_TIM0_5_P21_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P23_0_IN;  /**< \brief IfxGtm_TIM0_5_P23_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P32_4_IN;  /**< \brief IfxGtm_TIM0_5_P32_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_5_P33_1_IN;  /**< \brief IfxGtm_TIM0_5_P33_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P01_4_IN;  /**< \brief IfxGtm_TIM0_6_P01_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P02_6_IN;  /**< \brief IfxGtm_TIM0_6_P02_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P10_4_IN;  /**< \brief IfxGtm_TIM0_6_P10_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P14_3_IN;  /**< \brief IfxGtm_TIM0_6_P14_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P20_0_IN;  /**< \brief IfxGtm_TIM0_6_P20_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P23_1_IN;  /**< \brief IfxGtm_TIM0_6_P23_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P23_2_IN;  /**< \brief IfxGtm_TIM0_6_P23_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_6_P33_2_IN;  /**< \brief IfxGtm_TIM0_6_P33_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P02_11_IN;  /**< \brief IfxGtm_TIM0_7_P02_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P02_7_IN;  /**< \brief IfxGtm_TIM0_7_P02_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P11_15_IN;  /**< \brief IfxGtm_TIM0_7_P11_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P14_4_IN;  /**< \brief IfxGtm_TIM0_7_P14_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P20_8_IN;  /**< \brief IfxGtm_TIM0_7_P20_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P23_3_IN;  /**< \brief IfxGtm_TIM0_7_P23_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P23_4_IN;  /**< \brief IfxGtm_TIM0_7_P23_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM0_7_P33_3_IN;  /**< \brief IfxGtm_TIM0_7_P33_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P00_9_IN;  /**< \brief IfxGtm_TIM1_0_P00_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P02_0_IN;  /**< \brief IfxGtm_TIM1_0_P02_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P10_7_IN;  /**< \brief IfxGtm_TIM1_0_P10_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P14_5_IN;  /**< \brief IfxGtm_TIM1_0_P14_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P14_7_IN;  /**< \brief IfxGtm_TIM1_0_P14_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P15_6_IN;  /**< \brief IfxGtm_TIM1_0_P15_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P21_2_IN;  /**< \brief IfxGtm_TIM1_0_P21_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P22_1_IN;  /**< \brief IfxGtm_TIM1_0_P22_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P33_10_IN;  /**< \brief IfxGtm_TIM1_0_P33_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_0_P33_4_IN;  /**< \brief IfxGtm_TIM1_0_P33_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P00_10_IN;  /**< \brief IfxGtm_TIM1_1_P00_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P02_1_IN;  /**< \brief IfxGtm_TIM1_1_P02_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P10_1_IN;  /**< \brief IfxGtm_TIM1_1_P10_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P14_6_IN;  /**< \brief IfxGtm_TIM1_1_P14_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P15_7_IN;  /**< \brief IfxGtm_TIM1_1_P15_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P21_3_IN;  /**< \brief IfxGtm_TIM1_1_P21_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P22_0_IN;  /**< \brief IfxGtm_TIM1_1_P22_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P33_5_IN;  /**< \brief IfxGtm_TIM1_1_P33_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_1_P33_9_IN;  /**< \brief IfxGtm_TIM1_1_P33_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P00_11_IN;  /**< \brief IfxGtm_TIM1_2_P00_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P02_2_IN;  /**< \brief IfxGtm_TIM1_2_P02_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P10_2_IN;  /**< \brief IfxGtm_TIM1_2_P10_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P10_5_IN;  /**< \brief IfxGtm_TIM1_2_P10_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P15_8_IN;  /**< \brief IfxGtm_TIM1_2_P15_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P21_4_IN;  /**< \brief IfxGtm_TIM1_2_P21_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P23_5_IN;  /**< \brief IfxGtm_TIM1_2_P23_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P23_6_IN;  /**< \brief IfxGtm_TIM1_2_P23_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P33_11_IN;  /**< \brief IfxGtm_TIM1_2_P33_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_2_P33_6_IN;  /**< \brief IfxGtm_TIM1_2_P33_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P00_12_IN;  /**< \brief IfxGtm_TIM1_3_P00_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P02_3_IN;  /**< \brief IfxGtm_TIM1_3_P02_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P10_3_IN;  /**< \brief IfxGtm_TIM1_3_P10_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P10_6_IN;  /**< \brief IfxGtm_TIM1_3_P10_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P14_0_IN;  /**< \brief IfxGtm_TIM1_3_P14_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P21_5_IN;  /**< \brief IfxGtm_TIM1_3_P21_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P22_2_IN;  /**< \brief IfxGtm_TIM1_3_P22_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P23_7_IN;  /**< \brief IfxGtm_TIM1_3_P23_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P32_2_IN;  /**< \brief IfxGtm_TIM1_3_P32_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_3_P33_7_IN;  /**< \brief IfxGtm_TIM1_3_P33_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P02_4_IN;  /**< \brief IfxGtm_TIM1_4_P02_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P10_0_IN;  /**< \brief IfxGtm_TIM1_4_P10_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P14_1_IN;  /**< \brief IfxGtm_TIM1_4_P14_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P20_0_IN;  /**< \brief IfxGtm_TIM1_4_P20_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P21_6_IN;  /**< \brief IfxGtm_TIM1_4_P21_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P22_3_IN;  /**< \brief IfxGtm_TIM1_4_P22_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P32_3_IN;  /**< \brief IfxGtm_TIM1_4_P32_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P33_0_IN;  /**< \brief IfxGtm_TIM1_4_P33_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_4_P33_8_IN;  /**< \brief IfxGtm_TIM1_4_P33_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P02_5_IN;  /**< \brief IfxGtm_TIM1_5_P02_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P10_8_IN;  /**< \brief IfxGtm_TIM1_5_P10_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P14_2_IN;  /**< \brief IfxGtm_TIM1_5_P14_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P20_7_IN;  /**< \brief IfxGtm_TIM1_5_P20_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P21_7_IN;  /**< \brief IfxGtm_TIM1_5_P21_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P23_0_IN;  /**< \brief IfxGtm_TIM1_5_P23_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P32_4_IN;  /**< \brief IfxGtm_TIM1_5_P32_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_5_P33_1_IN;  /**< \brief IfxGtm_TIM1_5_P33_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P02_6_IN;  /**< \brief IfxGtm_TIM1_6_P02_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P10_4_IN;  /**< \brief IfxGtm_TIM1_6_P10_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P14_3_IN;  /**< \brief IfxGtm_TIM1_6_P14_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P20_0_IN;  /**< \brief IfxGtm_TIM1_6_P20_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P23_1_IN;  /**< \brief IfxGtm_TIM1_6_P23_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P23_2_IN;  /**< \brief IfxGtm_TIM1_6_P23_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_6_P33_2_IN;  /**< \brief IfxGtm_TIM1_6_P33_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P02_7_IN;  /**< \brief IfxGtm_TIM1_7_P02_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P14_4_IN;  /**< \brief IfxGtm_TIM1_7_P14_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P20_8_IN;  /**< \brief IfxGtm_TIM1_7_P20_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P23_3_IN;  /**< \brief IfxGtm_TIM1_7_P23_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P23_4_IN;  /**< \brief IfxGtm_TIM1_7_P23_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM1_7_P33_3_IN;  /**< \brief IfxGtm_TIM1_7_P33_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P00_0_IN;  /**< \brief IfxGtm_TIM2_0_P00_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P01_3_IN;  /**< \brief IfxGtm_TIM2_0_P01_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P02_8_IN;  /**< \brief IfxGtm_TIM2_0_P02_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P11_0_IN;  /**< \brief IfxGtm_TIM2_0_P11_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P11_10_IN;  /**< \brief IfxGtm_TIM2_0_P11_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P13_3_IN;  /**< \brief IfxGtm_TIM2_0_P13_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P15_5_IN;  /**< \brief IfxGtm_TIM2_0_P15_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P20_12_IN;  /**< \brief IfxGtm_TIM2_0_P20_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P33_12_IN;  /**< \brief IfxGtm_TIM2_0_P33_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_0_P33_14_IN;  /**< \brief IfxGtm_TIM2_0_P33_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P00_1_IN;  /**< \brief IfxGtm_TIM2_1_P00_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P00_2_IN;  /**< \brief IfxGtm_TIM2_1_P00_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P01_4_IN;  /**< \brief IfxGtm_TIM2_1_P01_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P11_1_IN;  /**< \brief IfxGtm_TIM2_1_P11_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P11_2_IN;  /**< \brief IfxGtm_TIM2_1_P11_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P20_13_IN;  /**< \brief IfxGtm_TIM2_1_P20_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P33_13_IN;  /**< \brief IfxGtm_TIM2_1_P33_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_1_P33_15_IN;  /**< \brief IfxGtm_TIM2_1_P33_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P00_3_IN;  /**< \brief IfxGtm_TIM2_2_P00_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P01_5_IN;  /**< \brief IfxGtm_TIM2_2_P01_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P11_3_IN;  /**< \brief IfxGtm_TIM2_2_P11_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P11_4_IN;  /**< \brief IfxGtm_TIM2_2_P11_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P14_8_IN;  /**< \brief IfxGtm_TIM2_2_P14_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P15_6_IN;  /**< \brief IfxGtm_TIM2_2_P15_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P20_14_IN;  /**< \brief IfxGtm_TIM2_2_P20_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_2_P32_0_IN;  /**< \brief IfxGtm_TIM2_2_P32_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P00_4_IN;  /**< \brief IfxGtm_TIM2_3_P00_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P01_5_IN;  /**< \brief IfxGtm_TIM2_3_P01_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P11_5_IN;  /**< \brief IfxGtm_TIM2_3_P11_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P11_6_IN;  /**< \brief IfxGtm_TIM2_3_P11_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P14_9_IN;  /**< \brief IfxGtm_TIM2_3_P14_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P15_0_IN;  /**< \brief IfxGtm_TIM2_3_P15_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P20_1_IN;  /**< \brief IfxGtm_TIM2_3_P20_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_3_P34_1_IN;  /**< \brief IfxGtm_TIM2_3_P34_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P00_5_IN;  /**< \brief IfxGtm_TIM2_4_P00_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P11_7_IN;  /**< \brief IfxGtm_TIM2_4_P11_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P11_9_IN;  /**< \brief IfxGtm_TIM2_4_P11_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P14_10_IN;  /**< \brief IfxGtm_TIM2_4_P14_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P15_1_IN;  /**< \brief IfxGtm_TIM2_4_P15_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P20_3_IN;  /**< \brief IfxGtm_TIM2_4_P20_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P21_0_IN;  /**< \brief IfxGtm_TIM2_4_P21_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P34_2_IN;  /**< \brief IfxGtm_TIM2_4_P34_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P00_6_IN;  /**< \brief IfxGtm_TIM2_5_P00_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P01_6_IN;  /**< \brief IfxGtm_TIM2_5_P01_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P11_10_IN;  /**< \brief IfxGtm_TIM2_5_P11_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P11_8_IN;  /**< \brief IfxGtm_TIM2_5_P11_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P13_0_IN;  /**< \brief IfxGtm_TIM2_5_P13_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P15_2_IN;  /**< \brief IfxGtm_TIM2_5_P15_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P20_9_IN;  /**< \brief IfxGtm_TIM2_5_P20_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P21_1_IN;  /**< \brief IfxGtm_TIM2_5_P21_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P34_3_IN;  /**< \brief IfxGtm_TIM2_5_P34_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P00_7_IN;  /**< \brief IfxGtm_TIM2_6_P00_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P11_11_IN;  /**< \brief IfxGtm_TIM2_6_P11_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P11_13_IN;  /**< \brief IfxGtm_TIM2_6_P11_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P13_1_IN;  /**< \brief IfxGtm_TIM2_6_P13_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P15_3_IN;  /**< \brief IfxGtm_TIM2_6_P15_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P20_10_IN;  /**< \brief IfxGtm_TIM2_6_P20_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P20_6_IN;  /**< \brief IfxGtm_TIM2_6_P20_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P22_6_IN;  /**< \brief IfxGtm_TIM2_6_P22_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P34_4_IN;  /**< \brief IfxGtm_TIM2_6_P34_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P00_8_IN;  /**< \brief IfxGtm_TIM2_7_P00_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P01_7_IN;  /**< \brief IfxGtm_TIM2_7_P01_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P11_12_IN;  /**< \brief IfxGtm_TIM2_7_P11_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P11_14_IN;  /**< \brief IfxGtm_TIM2_7_P11_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P13_2_IN;  /**< \brief IfxGtm_TIM2_7_P13_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P15_4_IN;  /**< \brief IfxGtm_TIM2_7_P15_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P20_11_IN;  /**< \brief IfxGtm_TIM2_7_P20_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P20_7_IN;  /**< \brief IfxGtm_TIM2_7_P20_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P34_5_IN;  /**< \brief IfxGtm_TIM2_7_P34_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P00_0_IN;  /**< \brief IfxGtm_TIM3_0_P00_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P00_5_IN;  /**< \brief IfxGtm_TIM3_0_P00_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P02_6_IN;  /**< \brief IfxGtm_TIM3_0_P02_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P02_8_IN;  /**< \brief IfxGtm_TIM3_0_P02_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P11_11_IN;  /**< \brief IfxGtm_TIM3_0_P11_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P12_0_IN;  /**< \brief IfxGtm_TIM3_0_P12_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P13_3_IN;  /**< \brief IfxGtm_TIM3_0_P13_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P15_5_IN;  /**< \brief IfxGtm_TIM3_0_P15_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P20_12_IN;  /**< \brief IfxGtm_TIM3_0_P20_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P22_4_IN;  /**< \brief IfxGtm_TIM3_0_P22_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P33_0_IN;  /**< \brief IfxGtm_TIM3_0_P33_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P33_12_IN;  /**< \brief IfxGtm_TIM3_0_P33_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_1_IN;  /**< \brief IfxGtm_TIM3_1_P00_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_2_IN;  /**< \brief IfxGtm_TIM3_1_P00_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_6_IN;  /**< \brief IfxGtm_TIM3_1_P00_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P02_7_IN;  /**< \brief IfxGtm_TIM3_1_P02_7_IN */
